# Checker Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Checker Members
Checker Class Properties See Also
---
The Checker type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckerColor1 | The property labeled "Color 1" from the "Checker" schema. |
| CheckerColor2 | The property labeled "Color 2" from the "Checker" schema. |
| CheckerSoften | The property labeled "Soften" from the "Checker" schema. |
| TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Checker" schema. |
| TextureOffsetLock | The property labeled "Offset Lock" from the "Checker" schema. |
| TextureRealWorldOffsetX | The property labeled "Offset X" from the "Checker" schema. |
| TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Checker" schema. |
| TextureRealWorldScaleX | The property labeled "Size X" from the "Checker" schema. |
| TextureRealWorldScaleY | The property labeled "Size Y" from the "Checker" schema. |
| TextureScaleLock | The property labeled "Scale Lock" from the "Checker" schema. |
| TextureURepeat | The property labeled "U Repeat" from the "Checker" schema. |
| TextureVRepeat | The property labeled "V Repeat" from the "Checker" schema. |
| TextureWAngle | The property labeled "Rotation" from the "Checker" schema. |

# See Also
Checker Class
Autodesk.Revit.DB.Visual Namespace